## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.dataset will be created
  + resource "google_bigquery_dataset" "dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "serverless_processing_dataset"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "us-central1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "tenacious-moon-447908-u4"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = {
          + "goog-terraform-provisioned" = "true"
        }

      + access (known after apply)
    }

  # google_bigquery_table.table will be created
  + resource "google_bigquery_table" "table" {
      + creation_time                = (known after apply)
      + dataset_id                   = "serverless_processing_dataset"
      + deletion_protection          = true
      + effective_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                         = (known after apply)
      + expiration_time              = (known after apply)
      + generated_schema_columns     = (known after apply)
      + id                           = (known after apply)
      + ignore_auto_generated_schema = false
      + last_modified_time           = (known after apply)
      + location                     = (known after apply)
      + max_staleness                = (known after apply)
      + num_bytes                    = (known after apply)
      + num_long_term_bytes          = (known after apply)
      + num_rows                     = (known after apply)
      + project                      = "tenacious-moon-447908-u4"
      + schema                       = jsonencode(
            [
              + {
                  + name = "id"
                  + type = "STRING"
                },
              + {
                  + name = "name"
                  + type = "STRING"
                },
              + {
                  + name = "amount"
                  + type = "FLOAT"
                },
              + {
                  + name = "date"
                  + type = "STRING"
                },
            ]
        )
      + self_link                    = (known after apply)
      + table_id                     = "processed_data"
      + terraform_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + type                         = (known after apply)
    }

  # google_cloudfunctions2_function.function will be created
  + resource "google_cloudfunctions2_function" "function" {
      + description      = "Triggered by GCS upload, validates and loads data into BigQuery"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + environment      = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = "process-uploaded-file"
      + project          = "tenacious-moon-447908-u4"
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
      + url              = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "process_file"
          + environment_variables = (known after apply)
          + runtime               = "python311"
          + service_account       = (known after apply)

          + automatic_update_policy (known after apply)

          + source {
              + storage_source {
                  + bucket     = "tenacious-moon-447908-u4-function-code"
                  + generation = (known after apply)
                  + object     = "function-source.zip"
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.storage.object.v1.finalized"
          + pubsub_topic          = (known after apply)
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "us-central1"

          + event_filters {
              + attribute = "bucket"
              + value     = "tenacious-moon-447908-u4-data-bucket"
                # (1 unchanged attribute hidden)
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = (known after apply)
          + environment_variables            = (known after apply)
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 3
          + max_instance_request_concurrency = (known after apply)
          + service                          = (known after apply)
          + service_account_email            = "function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
          + timeout_seconds                  = (known after apply)
          + uri                              = (known after apply)
        }
    }

  # google_project_iam_custom_role.analyst will be created
  + resource "google_project_iam_custom_role" "analyst" {
      + deleted     = (known after apply)
      + description = "Can query BigQuery"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "bigquery.datasets.get",
          + "bigquery.jobs.create",
          + "bigquery.tables.get",
          + "bigquery.tables.getData",
          + "bigquery.tables.list",
        ]
      + project     = "tenacious-moon-447908-u4"
      + role_id     = "analystRole"
      + stage       = "GA"
      + title       = "Analyst Role"
    }

  # google_project_iam_custom_role.processor will be created
  + resource "google_project_iam_custom_role" "processor" {
      + deleted     = (known after apply)
      + description = "For Cloud Function processing"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "bigquery.datasets.get",
          + "bigquery.jobs.create",
          + "bigquery.tables.get",
          + "bigquery.tables.updateData",
          + "logging.logEntries.create",
          + "pubsub.topics.publish",
          + "storage.objects.get",
          + "storage.objects.list",
        ]
      + project     = "tenacious-moon-447908-u4"
      + role_id     = "processorRole"
      + stage       = "GA"
      + title       = "Processor Role"
    }

  # google_project_iam_custom_role.uploader will be created
  + resource "google_project_iam_custom_role" "uploader" {
      + deleted     = (known after apply)
      + description = "Can only write to bucket"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "storage.objects.create",
          + "storage.objects.get",
          + "storage.objects.list",
        ]
      + project     = "tenacious-moon-447908-u4"
      + role_id     = "uploaderRole"
      + stage       = "GA"
      + title       = "Uploader Role"
    }

  # google_project_iam_member.analyst_bind will be created
  + resource "google_project_iam_member" "analyst_bind" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + project = "tenacious-moon-447908-u4"
      + role    = (known after apply)
    }

  # google_project_iam_member.processor_bind will be created
  + resource "google_project_iam_member" "processor_bind" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + project = "tenacious-moon-447908-u4"
      + role    = (known after apply)
    }

  # google_project_iam_member.uploader_bind will be created
  + resource "google_project_iam_member" "uploader_bind" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + project = "tenacious-moon-447908-u4"
      + role    = (known after apply)
    }

  # google_pubsub_topic.topic will be created
  + resource "google_pubsub_topic" "topic" {
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + name             = "data-processed-topic"
      + project          = "tenacious-moon-447908-u4"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }

      + message_storage_policy (known after apply)
    }

  # google_service_account.analyst_sa will be created
  + resource "google_service_account" "analyst_sa" {
      + account_id   = "analyst-sa"
      + disabled     = false
      + display_name = "Analyst Service Account"
      + email        = "analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "tenacious-moon-447908-u4"
      + unique_id    = (known after apply)
    }

  # google_service_account.function_sa will be created
  + resource "google_service_account" "function_sa" {
      + account_id   = "function-processor-sa"
      + disabled     = false
      + display_name = "Cloud Function Processor Service Account"
      + email        = "function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "tenacious-moon-447908-u4"
      + unique_id    = (known after apply)
    }

  # google_service_account.uploader_sa will be created
  + resource "google_service_account" "uploader_sa" {
      + account_id   = "uploader-sa"
      + disabled     = false
      + display_name = "Uploader Service Account"
      + email        = "uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "tenacious-moon-447908-u4"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.data_bucket will be created
  + resource "google_storage_bucket" "data_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "tenacious-moon-447908-u4-data-bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.function_bucket will be created
  + resource "google_storage_bucket" "function_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "tenacious-moon-447908-u4-function-code"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_object.function_zip will be created
  + resource "google_storage_bucket_object" "function_zip" {
      + bucket         = "tenacious-moon-447908-u4-function-code"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "function-source.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./../cloud-function/function-source.zip"
      + storage_class  = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>